package info.phj233.onlinechat.config;

import lombok.Data;

/**
 * JWT配置类
 * @author phj233
 * @since  2023/3/10 23:43
 * @version 1.0
 */
@Data
public class JWTConfig {
    /**
     * 密钥
     */
    public static String secret = """
            -----BEGIN PRIVATE KEY-----
            👎👋多🉐了😅🍺大📺都💊🐢⬆⭕🈸，⭕🈸1️⃣没招你惹你，2️⃣没干⬆👅害🎁🉐🔟情，
            🔪💦怎💊你了让你1️⃣📄🈚脑抹黑，㊙🐸🏊每👅费🈲🆕4️⃣🉐文🎨📕➗弘扬🀄国文🎨，
            你这🀄喷子📄会在网⬆敲⌨💦毁💡🆕公4️⃣，
            🀄国🎮🉐未来9️⃣🔟被你这🀄人毁掉🉐😅🍌👴🚪⭕🍺🉐😁🆕⚡👴在大街⬆💋🖐️给打过💡🈹👴在公共⬅1️⃣⬆🈚聊玩⭕🈸，
            🈶💡🈹B9️⃣从👴旁边过，看➖👴玩⭕🈸9️⃣悄悄说了1️⃣句:🈶🔟1️⃣🈹⭕🍺，
            👴9️⃣📄接⬆去1️⃣👊🐯脸⬆，👴根📕👋给他解🔟🉐📝会，👴✌️👋问他为🔟💊说👴🔟⭕🍺，👴9️⃣打，
            👴9️⃣看他👋爽，他惹👴了，👴9️⃣👋给他解🔟🉐📝会，📄接照着脸和脑🚪9️⃣打📄接给🌶️B🐯➗👃🦀，脸⬆青1️⃣🥢，
            紫1️⃣🥢🉐👴没4️⃣她👄8️⃣都🍋👌了你🚪这还👋🍋👄狠🉐，👴📝🉐👴1️⃣前😁🔟🐵春节去👴➕🎁，🈶1️⃣🉑核弹，
            👴1️⃣为🔟鞭🏃，和大💦红1️⃣7️⃣⚡了，当🔟🍺🎁👏🌶️🉐，然🐵🐰然1️⃣朵蘑🦴☁️平💦2️⃣7️⃣，
            当🔟👴9️⃣📄📝🉐💡🚬1️⃣黑，
            昏过去了，♨🈹村子没了，⭐👌👴🔟体🌧️生，🈸体素📄👋❌，㊗了📝👅⭕9️⃣没🔟了，
            📝🈹🈷⬇来🦵🦶才🎁落，🧵在1️⃣️⃣没🔟了，但🔟🌶️🀄💎🆕🉐疼还🔟让👴1️⃣生👨忘，
            #(😁😭)# (😁😭)#(😁😭)0️⃣人感叹🈲🧼1️⃣玩⭕🈸，👴便昏💀了过去，🧵在才刚刚缓过来。
            在昏💀过去🉐短短📕😁🔟内，👴🉐🧠仿佛被🌪️🈚📕🧲摧毁。在⭕🈸这1️⃣🈸⬅🉐🍜前，
            👴9️⃣🐘1️⃣🈹1️⃣4️⃣👋🍉🉐⭕🔟人🐰然来🔪了🧵代都🔟，2️⃣🧲⭕1️⃣如高楼大⌛📉👴👴👴💦吸🎵，
            开放🌏9️⃣🐰然变成🌶️📢轰鸣🉐🚗，👋🈲8️⃣👴⬇🈹❌🖐️👋📝，
            还让👴瞬➖📉㊗1️⃣完⭕放在了这🆕🉐7️⃣5️⃣⬆🍜，
            2️⃣还没💡👴稍微平复🆕情，纹🎨📕➗🉐➗🧵9️⃣如同🚬前遮👅🖊☀️🉐🌧️宙战➖，📉👴
            -----END PRIVATE KEY-----
            """;
    /**
     * 过期时间30分钟
     */
    public static Long expiration = 30L;
    /**
     * Token前缀
     */
    public static String tokenPrefix = "Bearer ";
    /**
     * TokenKey
     */
    public static String tokenHeader = "Authorization";
    /**
     * 不需要认证的路径
     */
    public String antMatchers;

}
